7767517
42 47
Input                    in0                      0 1 in0
MemoryData               model.body_heatmap       0 1 1 0=1 1=1 2=64
Split                    splitncnn_0              1 2 1 2 3
Slice                    unbind_0                 1 2 in0 4 5 -23300=2,-233,-233 1=1
Reshape                  reshape_21               1 1 5 6 0=64
Reshape                  reshape_22               1 1 4 7 0=64
Reshape                  reshape_23               1 1 7 8 0=1 1=1 2=64
Reshape                  reshape_24               1 1 6 9 0=1 1=1 2=64
MemoryData               pnnx_fold_82             0 1 10 0=120 1=120 2=64
MemoryData               pnnx_fold_84             0 1 11 0=120 1=120 2=64
BinaryOp                 sub_0                    2 1 9 11 12 0=1
UnaryOp                  pow_1                    1 1 12 13 0=4
BinaryOp                 mul_2                    2 1 13 2 14 0=2
BinaryOp                 sub_3                    2 1 8 10 15 0=1
UnaryOp                  pow_4                    1 1 15 16 0=4
BinaryOp                 mul_5                    2 1 16 3 17 0=2
BinaryOp                 add_6                    2 1 17 14 18 0=0
UnaryOp                  neg_7                    1 1 18 19 0=1
UnaryOp                  exp_8                    1 1 19 20 0=7
Convolution              convrelu_0               1 1 20 21 0=128 1=3 11=3 12=1 13=2 14=1 2=1 3=2 4=1 5=1 6=73728 9=1
BatchNorm                bn_0                     1 1 21 22 0=128 1=1.000000e-05
BatchNorm                bn_1                     1 1 22 23 0=128 1=1.000000e-05
Split                    splitncnn_1              1 2 23 24 25
Convolution              convrelu_1               1 1 25 26 0=128 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=147456 9=1
Convolution              conv_4                   1 1 26 27 0=128 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=147456
BinaryOp                 add_9                    2 1 24 27 28 0=0
Split                    splitncnn_2              1 2 28 29 30
Convolution              convrelu_2               1 1 30 31 0=128 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=147456 9=1
Convolution              conv_6                   1 1 31 32 0=128 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=147456
BinaryOp                 add_10                   2 1 29 32 33 0=0
Split                    splitncnn_3              1 2 33 34 35
Convolution              convrelu_3               1 1 35 36 0=128 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=147456 9=1
Convolution              conv_8                   1 1 36 37 0=128 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=147456
BinaryOp                 add_11                   2 1 34 37 38 0=0
Deconvolution            deconvrelu_0             1 1 38 39 0=64 1=4 11=4 12=1 13=2 14=1 18=0 19=0 2=1 3=2 4=1 5=1 6=131072 9=1
Deconvolution            deconvrelu_1             1 1 39 40 0=32 1=4 11=4 12=1 13=2 14=1 18=0 19=0 2=1 3=2 4=1 5=1 6=32768 9=1
Deconvolution            deconvrelu_2             1 1 40 41 0=16 1=4 11=4 12=1 13=2 14=1 18=0 19=0 2=1 3=2 4=1 5=1 6=8192 9=1
Convolution              conv_9                   1 1 41 42 0=3 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=432
TanH                     tanh_20                  1 1 42 43
BinaryOp                 add_12                   1 1 43 44 0=0 1=1 2=1.000000e+00
BinaryOp                 div_13                   1 1 44 45 0=3 1=1 2=2.000000e+00
BinaryOp                 mul_14                   1 1 45 out0 0=2 1=1 2=2.550000e+02
